slashprototype/tm4c_stspin820_driver/vnh5019A_driver.c
/*
 * @file        vnh5019A_driver.c
 * 
 * @brief
 * Source file for vnh5019A Motor control H-bridge driver
 * 
 * @details
 * This is a CIDESI library, all rights reserved
 * 
 * @date        09 January 2024
 * @version     1.0.0
 * @author      Luis Juarez
 * @copyright   CIDESI� 2024
 * 
*/


#include <drivers/vnh5019A/vnh5019A_driver.h>
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/gpio.h"
#include "driverlib/pwm.h"
#include "driverlib/pin_map.h"
#include "driverlib/sysctl.h"

void dcMotorSetConfig(vnh5019A_driver_t* driver, dc_motor_config_t configuration){
    pinWrite(driver->in_a, (configuration & 0b1000));
    pinWrite(driver->in_b, (configuration & 0b0100));
    pinWrite(driver->en_a, (configuration & 0b0010));
    pinWrite(driver->en_b, (configuration & 0b0001));
}

void dcMotorConfigPWM(pwm_module_t *pwm_module){
    PWMGenDisable(pwm_module->hw_base, pwm_module->pwm_gen);
    PWMGenConfigure(pwm_module->hw_base, pwm_module->pwm_gen, pwm_module->pwm_gen_mode);
    PWMGenPeriodSet(pwm_module->hw_base, pwm_module->pwm_gen, pwm_module->frequency_hz); /* 3332 -> 24.010 KHz PWM_SYSCLK_DIV_1*/
    PWMPulseWidthSet(pwm_module->hw_base, pwm_module->pwm_out, pwm_module->pulse_width); /* 3332 -> 100% */
    PWMGenEnable(pwm_module->hw_base,pwm_module->pwm_gen);
    PWMOutputState(pwm_module->hw_base,pwm_module->pwm_out_bit,true);
}

